benchmarks/suites/anilove/artillery/test-ecs.yml
config:
  target: "https://REPLACE_ME"
  # WARNING: rates unverified, never piloted. Unlike the other two suites the
  # ceiling cannot be derived from them: about half of each request is database
  # wait. Run make pilot-anilove and rewrite these.
  # Shape and mechanics are correct; the numbers assume a conservative 20 ms per
  # request, so 50 req/s for one worker, 10 arrivals/s. The local probe measured
  # 3.0 ms against a container-local Postgres, so these err low.
  phases:
  # FIVE requests per arrival: arrivalCount is one fifth of the request rate.
  # arrivalCount, not arrivalRate: a rate starts every user of a second at once.

    # Warm-up at the primary rate. Discarded.
    - duration: 180
      arrivalCount: 900

    # Probe, 1.5 arrivals/s = 7.5 req/s, 15% of the assumed ceiling.
    - duration: 360
      arrivalCount: 540

    # Probe, 3 arrivals/s = 15 req/s, 30%.
    - duration: 360
      arrivalCount: 1080

    # Primary, 5 arrivals/s = 25 req/s, 50%. Source of every reported figure.
    - duration: 720
      arrivalCount: 3600

    # Probe, 7 arrivals/s = 35 req/s, 70%. A throttled Lambda behind the ALB
    # returns 502, not 429; count 502s or read CloudWatch Throttles.
    - duration: 360
      arrivalCount: 2520

  defaults:
    headers:
      Content-Type: application/json
      Host: anilove-ecs.bench.local
    http:
      timeout: 60

  plugins:
    publish-metrics:
      - type: prometheus
        pushgateway: "http://localhost:9092"
        testName: "anilove-load-test"
        environment: "production"
        labels:
          service: "anilove-service"
          scenario: "animes-crud"
          instance: ecs

scenarios:
  - name: Animes CRUD
    flow:
      # 1) Create an anime
      - post:
          url: "/animes"
          capture:
            - json: "$.id"      # Captures the ID returned by the POST request
              as: "animeId"
          json:
            title: "Anime_{{ $randomNumber(1,9999) }}_{{ $timestamp }}_{{ $uuid }}"
            genre: ["Action", "Fantasy"]
            episodes: "{{ $randomNumber(12, 50) }}"
            note: "{{ $randomNumber(1, 10) }}"

      # 2) List all anime
      - get:
          url: "/animes"

      # 3) Search for the created anime (using captured ID)
      - get:
          url: "/animes/{{ animeId }}"

      # 4) Update the anime
      - put:
          url: "/animes/{{ animeId }}"
          json:
            title: "Anime_Updated_{{ $randomNumber(1, 9999) }}_{{ $uuid }}"
            genre: ["Adventure"]
            episodes: 24
            note: 9

      # 5) Delete the created anime
      - delete:
          url: "/animes/{{ animeId }}"