benchmarks/suites/anilove/artillery/test-ecs.yml
config:
  target: "https://REPLACE_ME"
  # ------------------------------------------------------------
  # WARNING: rates below are unverified. They date from the retired
  # t2.micro / t3.small hardware and have not been re-derived for the
  # current one-worker-per-platform setup, so they run above the
  # saturation ceiling. Run the pilot (make pilot-configs, then
  # make pilot-<suite>) and set the phases from the measured ceiling.
  # See docs/PAPER-SSCAD-2026.md.
  # ------------------------------------------------------------
  phases:
    # Phase 1 - Warm-up:
    # Gradually warms the environments without pressure.
    # Ensures Lambda starts containers, ECS pulls images if needed, and EC2 establishes steady CPU usage.
    # Captures cold-start behavior and stabilizes connections/caches before real load.
    - duration: 360        # 6 minutes
      arrivalRate: 5

    # Phase 2 - Primary Soak (steady-state load):
    # Maintains a realistic constant load to observe long-term behavior.
    # Ideal to reveal steady-state latency once caches and JIT have settled on each platform.
    # This phase is crucial to compare environments under sustained, non-burst conditions.
    - duration: 600        # 10 minutes
      arrivalRate: 20

    # Phase 3 - Stress Peak:
    # Pushes the environments to higher pressure to expose bottlenecks.
    # Used to analyze how Lambda rejects with HTTP 429 at reserved concurrency 1,
    # while EC2 and ECS queue instead and degrade in latency.
    # Reveals p95/p99 degradation patterns beyond normal workloads.
    - duration: 360        # 6 minutes
      arrivalRate: 50

    # Phase 4 - Recovery + Secondary Soak:
    # Returns the load to the same level as the first soak to observe recovery behavior.
    # Validates if latencies return to pre-stress levels or if any environment remains degraded.
    # Critical to detect whether any platform remains degraded after the peak.
    - duration: 600        # 10 minutes
      arrivalRate: 20

  defaults:
    headers:
      Content-Type: application/json
      Host: anilove-ecs.bench.local
    http:
      timeout: 60

  plugins:
    publish-metrics:
      - type: prometheus
        pushgateway: "http://localhost:9092"
        testName: "anilove-load-test"
        environment: "production"
        labels:
          service: "anilove-service"
          scenario: "animes-crud"
          instance: ecs

scenarios:
  - name: Animes CRUD
    flow:
      # 1) Create an anime
      - post:
          url: "/animes"
          capture:
            - json: "$.id"      # Captures the ID returned by the POST request
              as: "animeId"
          json:
            title: "Anime_{{ $randomNumber(1,9999) }}_{{ $timestamp }}_{{ $uuid }}"
            genre: ["Action", "Fantasy"]
            episodes: "{{ $randomNumber(12, 50) }}"
            note: "{{ $randomNumber(1, 10) }}"

      # 2) List all anime
      - get:
          url: "/animes"

      # 3) Search for the created anime (using captured ID)
      - get:
          url: "/animes/{{ animeId }}"

      # 4) Update the anime
      - put:
          url: "/animes/{{ animeId }}"
          json:
            title: "Anime_Updated_{{ $randomNumber(1, 9999) }}_{{ $uuid }}"
            genre: ["Adventure"]
            episodes: 24
            note: 9

      # 5) Delete the created anime
      - delete:
          url: "/animes/{{ animeId }}"